**dataframe由多个series组成，不同series中数据类型可不同，单个series中数据类型也可以不同，可看成一个表格,numpy中n维数组必须所有数据类型一致,虽说使用list创建df但是pandas还是会基于list中数据创建出对应的series，df一直都是由series组成！！**

In [2]:
import pandas as pd

# 创建dataframe-Series+dict

## 方式1

In [2]:
s_id = pd.Series(['01','02','03','04','05'])

In [3]:
s_class = pd.Series(['二班','一班','二班','三班','一班'])

In [4]:
s_grate = pd.Series([97,88,65,77,84])

注意这里是创建一个series变量，df的一些操作也可以从df中提取出series变量（一列）

In [5]:
df1 = pd.DataFrame({'学号':s_id,'班级':s_class,'成绩':s_grate})
df1

   学号  班级  成绩
0  01  二班  97
1  02  一班  88
2  03  二班  65
3  04  三班  77
4  05  一班  84

## 方式2-list+dict

In [6]:
s_id = ['01','02','03','04','05']

In [7]:
s_class = ['二班','一班','二班','三班','一班']

In [8]:
s_grate = [97,88,65,77,84]

In [47]:
df2 = pd.DataFrame({'学号':s_id,'班级':s_class,'成绩':s_grate})
print(df2)
df2

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65
小刚  04  三班  77
小康  05  一班  84

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65
小刚  04  三班  77
小康  05  一班  84

## 方式3-创建带标签索引的-每一个series都需要加索引

In [10]:
s_id = pd.Series(['01','02','03','04','05'],index=['小米','小季','小邦','小刚','小康'])

In [11]:
s_class = pd.Series(['二班','一班','二班','三班','一班'],index=['小米','小季','小邦','小刚','小康'])

In [12]:
s_grate = pd.Series([97,88,65,77,84],index=['小米','小季','小邦','小刚','小康'])

In [13]:
df3 = pd.DataFrame({'学号':s_id,'班级':s_class,'成绩':s_grate})
df3

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65
小刚  04  三班  77
小康  05  一班  84

## 方式4-创建带标签索引的-嵌套dict

In [3]:
df4 = pd.DataFrame({
    '学号':{'小米':'01','小季':'02','小邦':'03','小刚':'04','小康':'05'},
    '班级':{'小米':'二班','小季':'一班','小邦':'二班','小刚':'三班','小康':'一班'},
    '成绩':{'小米':97,'小季':88,'小邦':65,'小刚':77,'小康':84},
    
})
df4

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65
小刚  04  三班  77
小康  05  一班  84

Python不允许十进制整数以0开头所以要以字符串形式显示'01'

## 获取索引,列名,值,以及对df进行行列转置

In [15]:
df4.index

Index(['小米', '小季', '小邦', '小刚', '小康'], dtype='object')

In [16]:
df4.columns

Index(['学号', '班级', '成绩'], dtype='object')

In [17]:
df4.values

array([['01', '二班', 97],
       ['02', '一班', 88],
       ['03', '二班', 65],
       ['04', '三班', 77],
       ['05', '一班', 84]], dtype=object)

In [18]:
df4.T

    小米  小季  小邦  小刚  小康
学号  01  02  03  04  05
班级  二班  一班  二班  三班  一班
成绩  97  88  65  77  84

## 提取df的单个列-列名

In [19]:
df4['班级']

小米    二班
小季    一班
小邦    二班
小刚    三班
小康    一班
Name: 班级, dtype: object

In [20]:
df4.班级

小米    二班
小季    一班
小邦    二班
小刚    三班
小康    一班
Name: 班级, dtype: object

## 提取df的部分列

In [9]:
df4.loc[:,'班级':'成绩']

    班级  成绩
小米  二班  97
小季  一班  88
小邦  二班  65
小刚  三班  77
小康  一班  84

In [11]:
df4.iloc[:,1:3]

    班级  成绩
小米  二班  97
小季  一班  88
小邦  二班  65
小刚  三班  77
小康  一班  84

**注意，当列名中有特殊符号或空格时，就只能通过[]来获取列**

## 提取df的任意列-列list

In [21]:
df4[['成绩','班级']]

    成绩  班级
小米  97  二班
小季  88  一班
小邦  65  二班
小刚  77  三班
小康  84  一班

## 提取df的单个行-索引

In [22]:
df4.loc['小米']

学号    01
班级    二班
成绩    97
Name: 小米, dtype: object

In [23]:
df4.iloc[0]

学号    01
班级    二班
成绩    97
Name: 小米, dtype: object

## 提取df的部分行-索引list切片注意标签左闭右闭，下标左闭右开

In [24]:
df4.loc['小米':'小邦']

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65

In [25]:
df4.iloc[0:2]

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88

## 提取df的任意行

In [26]:
df4.loc[['小米','小邦','小康']]

    学号  班级  成绩
小米  01  二班  97
小邦  03  二班  65
小康  05  一班  84

In [27]:
df4.iloc[[0,2,4]]

    学号  班级  成绩
小米  01  二班  97
小邦  03  二班  65
小康  05  一班  84

## 提取df的某个元素-行+列

In [28]:
df4.loc['小米','学号']

'01'

In [29]:
df4.iloc[0,0]

'01'

## 提取部分df-标签永远都是左闭右闭,下标永远都是左闭右开

In [30]:
df4.loc['小米':'小邦','班级':'成绩']

    班级  成绩
小米  二班  97
小季  一班  88
小邦  二班  65

In [31]:
df4.iloc[0:2,1:2]

    班级
小米  二班
小季  一班

In [32]:
df4.loc[:,'班级':'成绩']

    班级  成绩
小米  二班  97
小季  一班  88
小邦  二班  65
小刚  三班  77
小康  一班  84

In [33]:
df4.iloc[:,1:3]

    班级  成绩
小米  二班  97
小季  一班  88
小邦  二班  65
小刚  三班  77
小康  一班  84

In [34]:
df4.loc[['小米','小康'],'班级':'成绩']

    班级  成绩
小米  二班  97
小康  一班  84

In [35]:
df4.iloc[[0,4],1:3]

    班级  成绩
小米  二班  97
小康  一班  84

## 根据条件筛选df的行（df中行为实例，列为属性）

In [36]:
df4.成绩 > 80

小米     True
小季     True
小邦    False
小刚    False
小康     True
Name: 成绩, dtype: bool

In [37]:
df4[df4.成绩>80]

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小康  05  一班  84

In [38]:
df4[df4['成绩']>80]

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小康  05  一班  84

&|~

In [39]:
df4[ (df4.成绩>60) & (df4['班级']=='一班')]

    学号  班级  成绩
小季  02  一班  88
小康  05  一班  84

## head()默认返回数据的前5行

In [40]:
df4.head()

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65
小刚  04  三班  77
小康  05  一班  84

In [41]:
df4.head(2)

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88

tips:提取df的任意部分用[]，连续部分用:<br>若用标签索引表示则左闭右闭，下标则为左闭右开！！！！<br>df中关于行的一律加上.loc/.iloc,列无需<br>:表示从头到尾

In [42]:
df4.loc['小米':'小康',:]

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65
小刚  04  三班  77
小康  05  一班  84

In [43]:
df4.loc['小米':'小康','学号':'班级']

    学号  班级
小米  01  二班
小季  02  一班
小邦  03  二班
小刚  04  三班
小康  05  一班

In [45]:
df4.loc['小米':'小康',['学号','班级','成绩']]

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65
小刚  04  三班  77
小康  05  一班  84

In [46]:
df4.iloc[0:5,0:3]

    学号  班级  成绩
小米  01  二班  97
小季  02  一班  88
小邦  03  二班  65
小刚  04  三班  77
小康  05  一班  84

# 练习

In [1]:
import pandas as pd

创建一个叫 students 的DataFrame. 包含列名姓名、性别、身高，数据分别对应创建好的 name 、 gender 、以及 height 这三个Series。输出创建好的 students 。
创建一个叫 name 的Series. 里面包含字符串元素「小陈」，「小李」，「小王」，「小张」，「小赵」，「小周」，标签为 “001”，“002”，“003”，“004”，“005”，“006”。
创建一个叫 gender 的Series. 里面包含字符串元素 “女”，“女”，“男”，“男”，“女”，“男”，标签为 “006”，“005”，“004”，“003”，“002”，“001”。
创建一个叫 height 的Series，里面包含浮点数元素 172.5，168.0，178.2，181.3，161.7，标签为 “001”，“002”，“003”，“004”，“005”。

In [2]:
name = pd.Series(['小陈','小李','小王','小张','小赵','小周'],index=['001','002','003','004','005','006'])
gender = pd.Series(['女','女','男','男','女','男'],index=['006','005','004','003','002','001'])
height = pd.Series([172.5,168.0,178.2,181.3,161.7],index=['001','002','003','004','005'])
students = pd.DataFrame({'姓名':name,'性别':gender,'身高':height})
students

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女    NaN

打印 students 所有索引和列名。

In [3]:
print(students.index)
students.columns

Index(['001', '002', '003', '004', '005', '006'], dtype='object')

Index(['姓名', '性别', '身高'], dtype='object')

输出把 students 的行和列进行转置后的结果（也可以students = pd.DataFrame({'姓名':name,'性别':gender,'身高':height}).T）

In [4]:
students.T

      001    002    003    004    005  006
姓名     小陈     小李     小王     小张     小赵   小周
性别      男      女      男      男      女    女
身高  172.5  168.0  178.2  181.3  161.7  NaN

输出 students 的身高列。

In [5]:
students.身高

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006      NaN
Name: 身高, dtype: float64

In [6]:
students['身高']

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006      NaN
Name: 身高, dtype: float64

输出 students 的性别和身高列。

In [7]:
students[['性别','身高']]

    性别     身高
001  男  172.5
002  女  168.0
003  男  178.2
004  男  181.3
005  女  161.7
006  女    NaN

输出 students 索引为003的行。

In [8]:
students[students.index == '003']

     姓名 性别     身高
003  小王  男  178.2

In [9]:
students.iloc[2]

姓名       小王
性别        男
身高    178.2
Name: 003, dtype: object

In [10]:
students.loc['003']

姓名       小王
性别        男
身高    178.2
Name: 003, dtype: object

输出 students 索引为003、004、005的行。

In [11]:
students.iloc[2:5,:]

     姓名 性别     身高
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7

In [12]:
students.loc['003':'005']

     姓名 性别     身高
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7

输出 students 里索引为005的身高

In [13]:
students.iloc[4,2]

np.float64(161.7)

In [14]:
students.loc['005','身高']

np.float64(161.7)

输出 students 索引为003、005的数据的姓名和身高。

In [15]:
students.iloc[[2,4],[0,2]]

     姓名     身高
003  小王  178.2
005  小赵  161.7

In [16]:
students.loc[['003','005'],['姓名','身高']]

     姓名     身高
003  小王  178.2
005  小赵  161.7

输出 students 索引为003、005的数据的所有变量。

In [17]:
students.iloc[[2,4],:]

     姓名 性别     身高
003  小王  男  178.2
005  小赵  女  161.7

In [18]:
students.loc[['003','005'],:]

     姓名 性别     身高
003  小王  男  178.2
005  小赵  女  161.7

输出 students 里身高大于165的女性。

In [19]:
students[(students.身高>165) & (students.性别 == '女')]

     姓名 性别     身高
002  小李  女  168.0

通过 head 方法，输出 students 前五行数据。

In [20]:
students.head()

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7

In [21]:
students.head(2)

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0